Autodesk.Navisworks.Api.Data.ModelTransformEventArgs
Event arguments for the model units and transform change event

Autodesk.Navisworks.Api.Data.ModelTransformEventArgs.AllowChange
Sets the allow change value. Unit and transform updates are not applied to the model when allow change is set to false.

Autodesk.Navisworks.Api.Data.ModelTransformEventArgs.GetSourceIsUI
Gets the whether the event source is the UI.

Autodesk.Navisworks.Api.Data.ModelTransformEventArgs.LinearUnits
Gets the model linear units to be applied.

Autodesk.Navisworks.Api.Data.ModelTransformEventArgs.Model
Gets the model.

Autodesk.Navisworks.Api.Data.ModelTransformEventArgs.Transform
Gets the transform to be applied.

Autodesk.Navisworks.Api.Data.ModelTransformEventArgs.TransformReverses
Gets the whether the transform will be reversed when applied.